Pandas Functions

In [2]:
import pandas as pd

In [8]:
csv1=pd.read_csv("C:\\Users\\PMYLS\\6.sample_data.csv")
csv1

            Name  Age Occupation  Salary
0       John Doe   28   Engineer   70000
1     Jane Smith   34     Doctor  120000
2    Emily Davis   22     Artist   50000
3  Michael Brown   45     Lawyer   95000

In [10]:
#if need to access only index from file data
csv1.index

RangeIndex(start=0, stop=4, step=1)

In [11]:
#if need to access  colmns from file data
csv1.columns

Index(['Name', 'Age', 'Occupation', 'Salary'], dtype='object')

In [12]:
#The describe() function in pandas is used to generate descriptive statistics of a DataFrame, giving a quick summary of the central tendency, dispersion, and shape of the datasetâ€™s distribution, excluding NaN values.

#Here's what each part of the output represents:

#Count: The number of non-null entries for each column.

#Mean: The average value of each column.

#Std (Standard Deviation): A measure of the amount of variation or dispersion in the column values.

#Min: The minimum value in each column.

#25%: The 25th percentile (first quartile), indicating that 25% of the data falls below this value.

#50% (Median): The 50th percentile (second quartile), indicating that 50% of the data falls below this value. This is also known as the median.

7#5%: The 75th percentile (third quartile), indicating that 75% of the data falls below this value.

#Max: The maximum value in each column.
csv1.describe()

             Age         Salary
count   4.000000       4.000000
mean   32.250000   83750.000000
std     9.810708   30379.543556
min    22.000000   50000.000000
25%    26.500000   65000.000000
50%    31.000000   82500.000000
75%    36.750000  101250.000000
max    45.000000  120000.000000

In [13]:
#to acess any fix data from file eg wnat to access first 2 rows
csv1.head(2)

         Name  Age Occupation  Salary
0    John Doe   28   Engineer   70000
1  Jane Smith   34     Doctor  120000

In [15]:
#to acess any fix data from file eg wnat to access last 2 rows
csv1.tail(1)

            Name  Age Occupation  Salary
3  Michael Brown   45     Lawyer   95000

In [19]:
#want to access any number of rows we give index numbers for this purpose
csv1[1:2]

         Name  Age Occupation  Salary
1  Jane Smith   34     Doctor  120000

In [20]:
#to show index number as array
csv1.index.array

<NumpyExtensionArray>
[0, 1, 2, 3]
Length: 4, dtype: int64

In [21]:
#to show dataframe data  as numpy array
csv1.to_numpy()

array([['John Doe', 28, 'Engineer', 70000],
       ['Jane Smith', 34, 'Doctor', 120000],
       ['Emily Davis', 22, 'Artist', 50000],
       ['Michael Brown', 45, 'Lawyer', 95000]], dtype=object)

In [27]:
# Sorting the DataFrame by index in descending order
csv1_sorted = csv1.sort_index(axis=0, ascending=False)
csv1_sorted

            Name  Age Occupation  Salary
3  Michael Brown   45     Lawyer   95000
2    Emily Davis   22     Artist   50000
1     Jane Smith   34     Doctor  120000
0       John Doe   28   Engineer   70000

In [30]:
#to chnage any data 
csv1.loc[1,"Name"]=" Syeda Fatima Sajid"
csv1

                  Name  Age Occupation  Salary
0             John Doe   28   Engineer   70000
1   Syeda Fatima Sajid   34     Doctor  120000
2          Emily Davis   22     Artist   50000
3        Michael Brown   45     Lawyer   95000

In [34]:
#to get any data using loc function
csv2=csv1.loc[[1,2],["Name","Occupation"]]
csv2

                  Name Occupation
1   Syeda Fatima Sajid     Doctor
2          Emily Davis     Artist

In [36]:
#to get any data using loc function
csv2=csv1.loc[:,["Name","Occupation"]]
csv2

                  Name Occupation
0             John Doe   Engineer
1   Syeda Fatima Sajid     Doctor
2          Emily Davis     Artist
3        Michael Brown     Lawyer

In [37]:
#to get any data using loc function
csv2=csv1.loc[[1,2],:]
csv2

                  Name  Age Occupation  Salary
1   Syeda Fatima Sajid   34     Doctor  120000
2          Emily Davis   22     Artist   50000

In [38]:
#to get any specific data using iloc function
csv2=csv1.iloc[0,1]
csv2

28

In [44]:
#to drop any  col
# Dropping the 'Name' column
csv2 = csv1.drop("Name", axis=1)

csv2

   Age Occupation  Salary
0   28   Engineer   70000
1   34     Doctor  120000
2   22     Artist   50000
3   45     Lawyer   95000

In [46]:
#to drop any row
# Dropping the 'Name' column
csv2 = csv1.drop(0, axis=0)

csv2

                  Name  Age Occupation  Salary
1   Syeda Fatima Sajid   34     Doctor  120000
2          Emily Davis   22     Artist   50000
3        Michael Brown   45     Lawyer   95000